In [2]:
list_1=[1,2,3,4,5]

In [7]:
list_1[1]

2

In [19]:
list_2=[['Ivan','Petrov',150,45],['Fedor','Kozlov',140,40]]

In [21]:
list_2[0][0]

'Ivan'

In [41]:
dict_1={'Petrov':['Ivan',150,45],'Kozlov':['Fedor',140,40],'Sidorov':['Anton',155,48],'Levin':['Misha',160,52]}

In [42]:
cnt=0
summ=0
for key in dict_1:
    cnt+=1
    summ+=dict_1[key][2]
    print(key,cnt,summ)
mean=summ/cnt
print('mean',mean)

Petrov 1 45
Kozlov 2 85
Sidorov 3 133
Levin 4 185
mean 46.25

In [26]:
dict_1['Petrov']

['Ivan', 150, 45]

In [27]:
import pandas

In [43]:
df=pandas.DataFrame.from_dict(dict_1,orient='index')

In [44]:
df

             0    1   2
Petrov    Ivan  150  45
Kozlov   Fedor  140  40
Sidorov  Anton  155  48
Levin    Misha  160  52

In [50]:
df.describe()

                1          2
count    4.000000   4.000000
mean   151.250000  46.250000
std      8.539126   5.057997
min    140.000000  40.000000
25%    147.500000  43.750000
50%    152.500000  46.500000
75%    156.250000  49.000000
max    160.000000  52.000000